Revit 2024 API
StructuralConnectionHandlerType.IsCustom Method
 Checks if StructuralConnectionHandlerType is custom.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public bool IsCustom()
Visual Basic
Public Function IsCustom As Boolean
Visual C++
public:
bool IsCustom()
Return Value
 True if StructuralConnectionHandlerType is custom.
See Also
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace